In [1]:
import numpy as np
import pandas as pd

### Hierarchical Indexing

Hierarchical indexing is an important feature of pandas that enables you to have mul‐
tiple (two or more) index levels on an axis. Somewhat abstractly, it provides a way for
you to work with higher dimensional data in a lower dimensional form. Let’s start
with a simple example; create a Series with a list of lists (or arrays) as the index:

In [23]:
data = pd.Series(np.random.randn(9),index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],[1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [24]:
data

a  1   -0.171890
   2   -0.978880
   3   -0.046395
b  1    0.658296
   3    0.575721
c  1    0.232201
   2    0.356422
d  2    0.422577
   3    0.211227
dtype: float64

In [25]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [26]:
data.loc['a']

1   -0.171890
2   -0.978880
3   -0.046395
dtype: float64

In [27]:
data.loc[['a','b']]

a  1   -0.171890
   2   -0.978880
   3   -0.046395
b  1    0.658296
   3    0.575721
dtype: float64

In [28]:
data.loc[:,2]

a   -0.978880
c    0.356422
d    0.422577
dtype: float64

In [29]:
data['a']

1   -0.171890
2   -0.978880
3   -0.046395
dtype: float64

In [30]:
data.unstack()

          1         2         3
a -0.171890 -0.978880 -0.046395
b  0.658296       NaN  0.575721
c  0.232201  0.356422       NaN
d       NaN  0.422577  0.211227

In [31]:
data.unstack().stack()

a  1   -0.171890
   2   -0.978880
   3   -0.046395
b  1    0.658296
   3    0.575721
c  1    0.232201
   2    0.356422
d  2    0.422577
   3    0.211227
dtype: float64

With a DataFrame, either axis can have a hierarchical index:

In [32]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],columns=[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']])

In [33]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [34]:
frame.index.names=['key1','key2']

In [35]:
frame

           Ohio     Colorado
          Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [42]:
frame.columns.names=['state','color']

In [43]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [44]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

##### Reordering and sorting lavels

At times you will need to rearrange the order of the levels on an axis or sort the data
by the values in one specific level. The swaplevel takes two level numbers or names
and returns a new object with the levels interchanged (but the data is otherwise
unaltered):

In [45]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [47]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [50]:
frame.sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [51]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [56]:
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

frame

In [57]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [59]:
frame.sum(level='key1')

state  Ohio     Colorado
color Green Red    Green
key1
a         3   5        7
b        15  17       19

In [61]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

##### Indexing with a DataFrame’s column

DataFrame as the row
index; alternatively, you may wish to move the row index into the DataFrame’s col‐
umns. Here’s an example DataFrame:

In [62]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                      'c': ['one', 'one', 'one', 'two', 'two','two', 'two'],'d': [0, 1, 2, 0, 1, 2, 3]})

In [63]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [69]:
frame2=frame.set_index(['b','c'])

In [70]:
frame2

       a  d
b c
7 one  0  0
6 one  1  1
5 one  2  2
4 two  3  0
3 two  4  1
2 two  5  2
1 two  6  3

In [71]:
frame.set_index(['b','c'],drop=False)

       a  b    c  d
b c
7 one  0  7  one  0
6 one  1  6  one  1
5 one  2  5  one  2
4 two  3  4  two  0
3 two  4  3  two  1
2 two  5  2  two  2
1 two  6  1  two  3

In [67]:
frame2

       a  b    c  d
b c
7 one  0  7  one  0
6 one  1  6  one  1
5 one  2  5  one  2
4 two  3  4  two  0
3 two  4  3  two  1
2 two  5  2  two  2
1 two  6  1  two  3

In [72]:
frame2.reset_index()

   b    c  a  d
0  7  one  0  0
1  6  one  1  1
2  5  one  2  2
3  4  two  3  0
4  3  two  4  1
5  2  two  5  2
6  1  two  6  3

In [75]:
frame2.reset_index().sort_index(axis=1)

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

##### Combining and merging and datasets

• pandas.merge connects rows in DataFrames based on one or more keys. This
will be familiar to users of SQL or other relational databases, as it implements
database join operations.

• pandas.concat concatenates or “stacks” together objects along an axis.

• The combine_first instance method enables splicing together overlapping data
to fill in missing values in one object with values from another.

##### Database style dataframe joins

Merge or join operations combine datasets by linking rows using one or more keys.
These operations are central to relational databases (e.g., SQL-based). The merge
function in pandas is the main entry point for using these algorithms on your data.

In [84]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],'data2': range(3)})

In [85]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [86]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [87]:
df1.merge(df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [88]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

Note that I didn’t specify which column to join on. If that information is not speci‐
fied, merge uses the overlapping column names as the keys. It’s a good practice to
specify explicitly, though:

In [93]:
pd.merge(df1,df2,on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

If the column names are different in each object, you can specify them separately:

In [96]:
pd.merge(df1,df2,left_on='data1',right_on='data2',suffixes=['_df1','_df2'])

  key_df1  data1 key_df2  data2
0       b      0       a      0
1       b      1       b      1
2       a      2       d      2

You may notice that the 'c' and 'd' values and associated data are missing from the
result. By default merge does an 'inner' join; the keys in the result are the intersec‐
tion, or the common set found in both tables. Other possible options are 'left' ,
'right' , and 'outer' . The outer join takes the union of the keys, combining the
effect of applying both left and right joins:

In [97]:
pd.merge(df1,df2,how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [98]:
pd.merge(df1,df2,how='left')

  key  data1  data2
0   b      0    1.0
1   b      1    1.0
2   a      2    0.0
3   c      3    NaN
4   a      4    0.0
5   a      5    0.0
6   b      6    1.0

In [99]:
pd.merge(df1,df2,how='right')

  key  data1  data2
0   b    0.0      1
1   b    1.0      1
2   b    6.0      1
3   a    2.0      0
4   a    4.0      0
5   a    5.0      0
6   d    NaN      2

In [102]:
pd.merge(df1,df2,how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [103]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],'key2': ['one', 'two', 'one'],'lval': [1, 2, 3]})
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                      'key2': ['one', 'one', 'one', 'two'],'rval': [4, 5, 6, 7]})

In [106]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [107]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [111]:
pd.merge(left,right,on=['key1','key2'],how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [114]:
pd.merge(left,right,on=['key1','key2'],how='outer',indicator='both')

  key1 key2  lval  rval        both
0  foo  one   1.0   4.0        both
1  foo  one   1.0   5.0        both
2  foo  two   2.0   NaN   left_only
3  bar  one   3.0   6.0        both
4  bar  two   NaN   7.0  right_only

##### Merging on index

In some cases, the merge key(s) in a DataFrame will be found in its index. In this
case, you can pass left_index=True or right_index=True (or both) to indicate that
the index should be used as the merge key:

In [115]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],'value': range(6)})

In [116]:
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [117]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [118]:
right1

   group_val
a        3.5
b        7.0

In [120]:
pd.merge(left1,right1,left_on='key',right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [121]:
pd.merge(left1,right1,left_index=True,right_index=True)

Empty DataFrame
Columns: [key, value, group_val]
Index: []

##### Concatenating along an axis

Another kind of data combination operation is referred to interchangeably as concat‐
enation, binding, or stacking. NumPy’s concatenate function can do this with
NumPy arrays:

In [122]:
arr=np.arange(12).reshape(3,4)

In [123]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [124]:
np.concatenate([arr,arr],axis=0)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [125]:
np.concatenate([arr,arr],axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In the context of pandas objects such as Series and DataFrame, having labeled axes
enable you to further generalize array concatenation. In particular, you have a num‐
ber of additional things to think about

concatenation on series

In [126]:
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])

In [127]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

Calling concat with these objects in a list glues together the values and indexes:

By default concat works along axis=0 , producing another Series. If you pass axis=1 ,
the result will instead be a DataFrame ( axis=1 is the columns):

In [128]:
pd.concat([s1,s2,s3],axis=1)

/home/icpl13698/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In this case there is no overlap on the other axis, which as you can see is the sorted
union (the 'outer' join) of the indexes. You can instead intersect them by passing
join='inner' :

In [131]:
s4=pd.concat([s1,s3])

In [132]:
pd.concat([s1,s4],axis=1,join='inner')

   0  1
a  0  0
b  1  1

In [133]:
s4

a    0
b    1
f    5
g    6
dtype: int64

In [134]:
s1

a    0
b    1
dtype: int64

You can even specify the axes to be used on the other axes with join_axes :

In [137]:
pd.concat([s1,s4],axis=1,join_axes=[['a','c','b','e']])

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  1.0
e  NaN  NaN

A potential issue is that the concatenated pieces are not identifiable in the result. Sup‐
pose instead you wanted to create a hierarchical index on the concatenation axis. To
do this, use the keys argument:

In [139]:
result=pd.concat([s1,s2,s3],keys=['one','two','three'])

In [140]:
result.unstack()

         a    b    c    d    e    f    g
one    0.0  1.0  NaN  NaN  NaN  NaN  NaN
two    NaN  NaN  2.0  3.0  4.0  NaN  NaN
three  NaN  NaN  NaN  NaN  NaN  5.0  6.0

In [141]:
result

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: int64

In [142]:
pd.concat([s1,s2,s3],axis=1,keys=['one','two','three'])

/home/icpl13698/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

A last consideration concerns DataFrames in which the row index does not contain
any relevant data:

In [159]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])

In [160]:
df1

          a         b         c         d
0 -0.314265  0.712252  0.830188 -0.814292
1 -3.191070 -0.987298 -0.196974  0.343625
2  0.254999 -1.528748  0.367741  0.301983

In [161]:
df2

          b         d         a
0 -1.599725 -0.976905 -0.408626
1 -0.582561 -0.239173 -0.848551

In [162]:
pd.concat([df1,df2],axis=0)

/home/icpl13698/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          a         b         c         d
0 -0.314265  0.712252  0.830188 -0.814292
1 -3.191070 -0.987298 -0.196974  0.343625
2  0.254999 -1.528748  0.367741  0.301983
0 -0.408626 -1.599725       NaN -0.976905
1 -0.848551 -0.582561       NaN -0.239173

In [165]:
pd.concat([df1,df2],axis=1,keys=['one','two'],ignore_index=True)

          0         1         2         3         4         5         6
0 -0.314265  0.712252  0.830188 -0.814292 -1.599725 -0.976905 -0.408626
1 -3.191070 -0.987298 -0.196974  0.343625 -0.582561 -0.239173 -0.848551
2  0.254999 -1.528748  0.367741  0.301983       NaN       NaN       NaN

##### Combining data with overlap

There is another data combination situation that can’t be expressed as either a merge
or concatenation operation. You may have two datasets whose indexes overlap in full
or part. As a motivating example, consider NumPy’s where function, which performs
the array-oriented equivalent of an if-else expression:

df1.combine_first(df1)

##### Reshaping and Pivoting

There are a number of basic operations for rearranging tabular data. These are alter‐
natingly referred to as reshape or pivot operations.

##### Reshaping with hierarchical indexing

Hierarchical indexing provides a consistent way to rearrange data in a DataFrame.
There are two primary actions:

stack
 This “rotates” or pivots from the columns in the data to the rows

unstack
 This pivots from the rows into the columns

In [166]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),index=pd.Index(['Ohio', 'Colorado'], name='state')
                    ,columns=pd.Index(['one', 'two', 'three'],name='number'))

In [167]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [169]:
d=data.stack()

In [170]:
d

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [171]:
d.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [173]:
d

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [174]:
d.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [175]:
d.unstack(1)

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [176]:
d

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [177]:
d.unstack('number')

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [178]:
d.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [179]:
d.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

by default innermost level is unstacked(same with stack)

Unstacking might introduce missing data if all of the values in the level aren’t found
in each of the subgroups:

In [180]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])
data2 = pd.concat([s1, s2], keys=['one', 'two'])

In [181]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [187]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

tacking filters out missing data by default, so the operation is more easily invertible:

In [188]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [189]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [ ]:
data2.rename()